In [1]:
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\will bailey\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\will bailey\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\will bailey\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\will bailey\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\will bailey\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
df = pd.read_csv('C:/Users/Will Bailey/Desktop/RWUCOMSC/comsc330/support/COMSC110S20.sec', sep='|', header=None)
df.drop(0)
df.columns = ['Data']
df

                               Data
0                  COMSC110S20  3.0
1        Pfssb, Hcfw,"6713436","C+"
2        Pfckb, Owrob,"6758502","C"
3        Qczs, Robwsz,"6704310","C"
4      Qfin, Xsggwqo,"6724981","C+"
5  Rspzcwg, Qoggobrfo,"6719465","I"
6      Vwzz, Psbxoawb,"6727795","W"

In [3]:
df[['Last Name', 'First Name', 'Student Id', 'Grade']] = df['Data'].str.split(',', expand=True)
df

,Data,Last Name,First Name,Student Id,Grade
0,COMSC110S20 3.0,COMSC110S20 3.0,None,None,None
1,"Pfssb, Hcfw,""6713436"",""C+""",Pfssb,Hcfw,"""6713436""","""C+"""
2,"Pfckb, Owrob,""6758502"",""C""",Pfckb,Owrob,"""6758502""","""C"""
3,"Qczs, Robwsz,""6704310"",""C""",Qczs,Robwsz,"""6704310""","""C"""
4,"Qfin, Xsggwqo,""6724981"",""C+""",Qfin,Xsggwqo,"""6724981""","""C+"""
5,"Rspzcwg, Qoggobrfo,""6719465"",""I""",Rspzcwg,Qoggobrfo,"""6719465""","""I"""
6,"Vwzz, Psbxoawb,""6727795"",""W""",Vwzz,Psbxoawb,"""6727795""","""W"""

In [5]:
df = df.drop('Data', axis = 1)
df

          Last Name  First Name Student Id Grade
0  COMSC110S20  3.0        None       None  None
1             Pfssb        Hcfw  "6713436"  "C+"
2             Pfckb       Owrob  "6758502"   "C"
3              Qczs      Robwsz  "6704310"   "C"
4              Qfin     Xsggwqo  "6724981"  "C+"
5           Rspzcwg   Qoggobrfo  "6719465"   "I"
6              Vwzz    Psbxoawb  "6727795"   "W"

In [ ]:
def get_GPA(data):
    
    return grade

In [10]:
for num in df['Grade']:

SyntaxError: invalid syntax (972229258.py, line 1)

In [11]:
data = {'numbers': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

# iterate through the 'numbers' column and get the mean
sum = 0
count = 0
for num in df['numbers']:
    sum += num
    count += 1
mean = sum / count

# print the mean
print(mean)

30.0